#+TITLE: Data Mining and Machine Learning
#+DATE: <2017-01-06 Fri>
#+AUTHOR: Colton Kopsa
#+EMAIL: Aghbac@Aghbac.local
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 25.1.1 (Org mode 8.2.10)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export

** TODO Code
#+BEGIN_SRC python :results output :tangle neural_net.py
  import pandas as pd
  import numpy as np
  import random

  def create_layer(numNeurons, numInputs):
      return [[random.uniform(-1.0, 1.0) for x in range(numInputs + 1)] for x in range(numNeurons)]
  def calc_threshold(input_vector, input_weights):
      return sum([x * y for x, y in zip([-1] + input_vector, input_weights)])
  def calc_activation(threshold):
      return 1/(1 + 2.71828**-threshold)
  def calc_error_output(activation, target):
      return activation * (1 - activation) * (activation - target)
  def calc_error_hidden(activation, weights, error):
      return activation * (1 - activation) * sum(map(lambda x,y:x*y, weights, error)) 
  def calc_weight(current_weight, learning_rate, error, activation):
      new_weight = list(np.subtract(current_weight, (learning_rate * error * activation)))
      return new_weight
  def create_classifier(numInputs, *layers):
      layer = layers[0]
      if len(layers) == 1:
          return [create_layer(layer, numInputs)]
      else:
          return [create_layer(layer, numInputs)] + create_classifier(layer, *layers[1:])
  def train(inputVector, targetVector, neural_net, learningRate):
      j_activation = map(lambda neuron_weights:
                           calc_activation(calc_threshold(inputVector, neuron_weights)),
                           neural_net[0])
      print j_activation
      if len(neural_net) == 1:
          j_error = map(lambda x:calc_error_output(x[0], x[1]), zip(j_activation, targetVector))
          return [map(lambda x:calc_weight(x[0], learningRate, x[1], x[2]), zip(neural_net[0], j_error, inputVector))], j_error
      else:
          jk_weights, k_error = train(j_activation, targetVector, neural_net[1:], learningRate)
          j_error = map(lambda x,y:calc_error_hidden(x, y, k_error), j_activation, zip(*jk_weights[0])[1:])
          return [map(lambda x:calc_weight(x[0], learningRate, x[1], x[2]), zip(neural_net[0], j_error, inputVector))] + jk_weights, j_error
  def classify(inputVector, neural_net):
      j_activation = map(lambda neuron_weights:
                           calc_activation(calc_threshold(inputVector, neuron_weights)),
                           neural_net[0])
      if len(neural_net) == 1:
          return j_activation
      else:
          return classify(j_activation, neural_net[1:])
  def accuracy(output, target):
      truePositive = 0
      falsePositive = 0
      for i in range(len(output)):
          if output[i] == target[i]:
              truePositive = truePositive + 1
          else:
              falsePositive = falsePositive + 1
      return float(truePositive) / len(output)
  def outputize(num, length):
      output = [0] * length
      output[num-1] = 1
      return output

  df = pd.read_csv("iris.data", header = None, names = ["sepal_length",
                                                        "sepal_width",
                                                        "petal_length",
                                                        "petal_width", "class"])
  df = df.sample(frac=1)
  df_input = df.drop("class", axis=1)
  df_norm = (df_input - df_input.mean()) / (df_input.max() - df_input.min())

  classifier = create_classifier(4, 4, 3)
  classes = list(set(df["class"]))
  targetVector = [classes.index(x) for x in df["class"]]
  output = map(np.argmax, [classify(row, classifier) for index, row in df_norm.iterrows()])
  print output
  for i in range(1):
      for index, row in df_norm.iterrows():
          classifier = train(row, outputize(targetVector[index], 3), classifier, .5)[:-1][0]
  output = map(np.argmax, [classify(row, classifier) for index, row in df_norm.iterrows()])
  print output
  print targetVector
  print accuracy(output, targetVector)

  df = pd.read_csv("diabetes.data", header = None)
  df_input = df.drop(list(df)[-1], axis=1)
  df_norm = (df_input - df_input.mean()) / (df_input.max() - df_input.min())
  df_norm
  #+END_SRC

  #+RESULTS:
  #+begin_example
  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
  [0.50977061418412783, 0.53846808327360762, 0.7340158295884236, 0.88713702204645195]
  [0.43829227136285703, 0.78852157298416281, 0.6433744351984374]
  [0.39292757095924097, 0.56418039710356083, 0.83112175511187103, 0.86549950592424885]
  [0.462537850934579, 0.77136569449025294, 0.63282234504471246]
  [0.38800479920838188, 0.56245502740949638, 0.840150206067665, 0.89234535786083224]
  [0.44791167035694363, 0.77818816206567409, 0.60674558101075859]
  [0.37964917816520899, 0.50396478715371462, 0.80453388571132611, 0.85215665100504701]
  [0.42551855406015693, 0.76526105589630877, 0.60610977162046675]
  [0.38699235760414857, 0.49391511050622577, 0.77193340508962893, 0.84958718290261115]
  [0.4281144758942475, 0.75471412580682606, 0.5775900498479194]
  [0.37572837282154764, 0.5696164254758902, 0.83579427478195478, 0.87341082769125877]
  [0.46379773433012367, 0.74156541571672496, 0.57871116311580861]
  [0.40595211691133704, 0.52281755205648905, 0.75487857188272123, 0.82557651648679531]
  [0.45964945763302822, 0.72722639094671071, 0.543460019543199]
  [0.41998084310107686, 0.5235590725498579, 0.77329264467672343, 0.85141479039650536]
  [0.45256434243126464, 0.73606133678205743, 0.52429978744009242]
  [0.3743108115163658, 0.56114180468712038, 0.84362523912062393, 0.88274272350446492]
  [0.45223992875059749, 0.73987799747819105, 0.51105177848742855]
  [0.45554205636841899, 0.51645655654753031, 0.73050120853771849, 0.85088912396260952]
  [0.44906324035252831, 0.72868272037528281, 0.47935150283784017]
  [0.42166634905486555, 0.52358689669984504, 0.79923584025663297, 0.8674169376757962]
  [0.4459644069481003, 0.71907081480282431, 0.50284759082144792]
  [0.4649965696093063, 0.52685805465355995, 0.67319279108449881, 0.7899402796315812]
  [0.43616107664398501, 0.69586025621024583, 0.52105639305489959]
  [0.39995960360872973, 0.56977043831067331, 0.84623379275367716, 0.86972972351619682]
  [0.44263525665476261, 0.68635941465010042, 0.55200515281322204]
  [0.3905595446773118, 0.48803727703890826, 0.68328392662675141, 0.69814427710147975]
  [0.42148756312404628, 0.66825504312308037, 0.55211942229946975]
  [0.43933721016480298, 0.51383417180109525, 0.73407271461883639, 0.84077070938620346]
  [0.42270418823062661, 0.66524101938970759, 0.53282845567746451]
  [0.37188467721139801, 0.54750270959430791, 0.8497528256332918, 0.87612084443999794]
  [0.42494048215635483, 0.64726526241528959, 0.56245878734515875]
  [0.36913622061107393, 0.56078983973741781, 0.82372843615037739, 0.84588554381272085]
  [0.42169143829206485, 0.65028890712753207, 0.54126031767890259]
  [0.41823163308640121, 0.53566043469126734, 0.82448207509712979, 0.90592292105724737]
  [0.40279439197923989, 0.66897158136232071, 0.50890774008193829]
  [0.37792138363367755, 0.57465256416375454, 0.83434963060607881, 0.87340083127176493]
  [0.40594716412136317, 0.64309008975323723, 0.53975901544183524]
  [0.38273287576815423, 0.51611887320995908, 0.75472962873690175, 0.84464089981350543]
  [0.38066145805743978, 0.66056779090495887, 0.50168065286181995]
  [0.49219422517084588, 0.55431691988339393, 0.71350702943742217, 0.85269321852626767]
  [0.38890291611079908, 0.64152880972203763, 0.52790976930767597]
  [0.38624449195173061, 0.58938623638467935, 0.82351593164907, 0.88177104691574171]
  [0.40628935238628061, 0.61877907016917255, 0.51660129841340263]
  [0.37720940172447015, 0.51485340860569462, 0.7530286137776333, 0.83274963282124115]
  [0.3984256010846487, 0.61825199385522844, 0.48329415923927344]
  [0.39102382244557266, 0.57109908622794292, 0.84571887660950362, 0.89652473853428605]
  [0.40773312959663804, 0.6158055384245299, 0.47273318416883731]
  [0.45062134843066887, 0.51982241277421426, 0.69987178711627751, 0.82926361475155819]
  [0.38888683699161619, 0.6346171708765983, 0.44712072957371118]
  [0.39053667415162807, 0.49126738616189009, 0.66937267874174, 0.79678418879765667]
  [0.38687310757246568, 0.62666860215208608, 0.43213683534745578]
  [0.3532144783032094, 0.56779191378663041, 0.81648755042981824, 0.86017088873079495]
  [0.40261919350101472, 0.61829980137176999, 0.42510912814097945]
  [0.45252830323012183, 0.51394732102766094, 0.72050246470308876, 0.84355271338298576]
  [0.38739005851018493, 0.61587626767049275, 0.43929897738029394]
  [0.41206838682914265, 0.52408944667246771, 0.78651403796087493, 0.87189920593470727]
  [0.3802637449771562, 0.59962153198190615, 0.45905441649631967]
  [0.45587136145504031, 0.52485155137198081, 0.75961652154908343, 0.87850176960387483]
  [0.39213416823971975, 0.58492230837740189, 0.43903118871413155]
  [0.36468103054301154, 0.5631960158756989, 0.84132529107267462, 0.88445452799662627]
  [0.39067917577549072, 0.5591096434121483, 0.46836644709521469]
  [0.44120495334728943, 0.53419269580953688, 0.68831709439960642, 0.84596694405612904]
  [0.3731165321637141, 0.55608291245314534, 0.47983834139944637]
  [0.46244057182332254, 0.54234277877426162, 0.75480901619086305, 0.85700478721607343]
  [0.3789340645414403, 0.56122624297868684, 0.47220708344456758]
  [0.4033935841340055, 0.59058049604092855, 0.82002366373370705, 0.86597901196301585]
  [0.38002008168838064, 0.55901991056462885, 0.46261987531724535]
  [0.43090403625334778, 0.53289212769671002, 0.7724490812806194, 0.86089929530541232]
  [0.37801787351566057, 0.55975899259949913, 0.43431727514428509]
  [0.40090358996201908, 0.56591371094226217, 0.85591045137605271, 0.90265036685735867]
  [0.37573232057804107, 0.5602609913558112, 0.41824934499247896]
  [0.39875563118097529, 0.48067103869485417, 0.75379277612449713, 0.83142409317066046]
  [0.37140366423767007, 0.57272019830075649, 0.40216953692121921]
  [0.40221474897473919, 0.52939491762420665, 0.79338605743527613, 0.86652333121553671]
  [0.39022538942919316, 0.54364360367318232, 0.38712660318628844]
  [0.38552097033547783, 0.46891991412863931, 0.69261813561192276, 0.78648215403721622]
  [0.38633825401611238, 0.55653841959117212, 0.38392543520695882]
  [0.49108954303341606, 0.54555925130871097, 0.76568509205300395, 0.88135385671932087]
  [0.403185707119676, 0.53192608540912245, 0.35664660559411809]
  [0.40941837177110185, 0.58454087797908771, 0.825217375934991, 0.8752141103006984]
  [0.42527696100515167, 0.50544490761247474, 0.35193670155417195]
  [0.50082258449557249, 0.5477482849700086, 0.80534194969774286, 0.9034743452799826]
  [0.43446658030999458, 0.49623780886611057, 0.32752754237501863]
  [0.42765950296517496, 0.5231665602729898, 0.80594239341273799, 0.88051905938949071]
  [0.41090333405483526, 0.52374023589510244, 0.32383646956902479]
  [0.3876913244614475, 0.55827462769201042, 0.84025908248696268, 0.86105885537647409]
  [0.41451019081966256, 0.52585805419290499, 0.32176059744081187]
  [0.4632271826486703, 0.51797873907551573, 0.76877275531650613, 0.85117618742350365]
  [0.39971140306483477, 0.52402071811001594, 0.34117716659050351]
  [0.43673389136168927, 0.49580675984465028, 0.76351772549234431, 0.82839839934688442]
  [0.38758742358743831, 0.5449559148415114, 0.33651014172918481]
  [0.41482715782609514, 0.50073619776915046, 0.78671585303528035, 0.83327080367824446]
  [0.38083812831895214, 0.55377007496573238, 0.32691278773521965]
  [0.38477129472116256, 0.49065732275778329, 0.75439354876453568, 0.79224517164784625]
  [0.37316304883685469, 0.56962469678208183, 0.32917683738945847]
  [0.47120482345016174, 0.51363366332278249, 0.77168322856441218, 0.88235833008411413]
  [0.3803201633808504, 0.54542154256609832, 0.29289369871611759]
  [0.39947685039861286, 0.55739960344614892, 0.82183007822339293, 0.83030065912724993]
  [0.39174961976579964, 0.54462177784606058, 0.30294567827998597]
  [0.41751250947183494, 0.5379422211955498, 0.8624711558288406, 0.88489488598716415]
  [0.39530765184102795, 0.53182455142605112, 0.27823392300511318]
  [0.40631524072231434, 0.48098505615411041, 0.8403443496727776, 0.90062625847136035]
  [0.36734493556665626, 0.56336526358534678, 0.26691166921351067]
  [0.36110366859155629, 0.55055913388231081, 0.81662320478096784, 0.81215204627316184]
  [0.38578000996700768, 0.53320816084041389, 0.31313695628602362]
  [0.43159964477638602, 0.50353960003819187, 0.80128860388524326, 0.8528166871545213]
  [0.36790329944337796, 0.53007882131619077, 0.31839408098898342]
  [0.39217755556092915, 0.46495790468578468, 0.73388466126352914, 0.76099059822342108]
  [0.37846516316052592, 0.53927433929181123, 0.33401315028092832]
  [0.41919003559707751, 0.5457131633990413, 0.85023386679313018, 0.87695365741479481]
  [0.38111002121961929, 0.48667710726498847, 0.32422587649132828]
  [0.44885420280870947, 0.5079363986008032, 0.79173365097706394, 0.85677118585948053]
  [0.36676471512731723, 0.51650362962159435, 0.31542835023404636]
  [0.48230836369050789, 0.51708115368958185, 0.69772013659734466, 0.83079990304876061]
  [0.35795255880874416, 0.53081110179814106, 0.310921242240357]
  [0.38621398679508767, 0.47065971977699128, 0.78488489280165841, 0.86653980001454012]
  [0.33531016425970572, 0.53161913688025197, 0.32246550821093611]
  [0.37496583888900309, 0.51141791500628009, 0.85777953108810423, 0.87759913054344696]
  [0.34293250047410112, 0.52452752678115955, 0.31292403520542139]
  [0.40300394210180907, 0.45473614581079314, 0.79831352363017849, 0.86187172966238434]
  [0.34233503705547869, 0.53235633754150635, 0.30435867703260255]
  [0.40139901874434741, 0.48946318373170444, 0.81621839061775647, 0.86713737993024131]
  [0.3599890941794196, 0.50790878798102734, 0.29529772215938882]
  [0.43784361094155849, 0.50760602769967378, 0.76207847950404073, 0.851901855318555]
  [0.37412489998441384, 0.49218204590599945, 0.28950030035824387]
  [0.45872769608562602, 0.52642470058650892, 0.80909179773048323, 0.88520620378517434]
  [0.37255142886683473, 0.46521914901848455, 0.29876259491541735]
  [0.4210079071073532, 0.567199187062989, 0.83232424461744392, 0.84362139734294905]
  [0.40264656578714253, 0.44176870305358784, 0.30331905294074452]
  [0.43251991793998412, 0.49938502332357843, 0.7587928050631374, 0.86037151103379128]
  [0.36706110374524886, 0.45957500005543733, 0.31749033780046643]
  [0.41981220053718526, 0.50819178706865198, 0.78409145641978995, 0.83188274251102923]
  [0.37152236787592391, 0.44570635179868351, 0.34535730863174657]
  [0.39135289125349626, 0.56201250902798938, 0.83975809744759622, 0.85553835444896309]
  [0.3923910442337511, 0.40982998278504496, 0.33258172946351339]
  [0.37388402476697952, 0.49388826331608471, 0.75176596362633574, 0.78260724084061961]
  [0.37419356300885259, 0.44420857918278828, 0.36817340995646747]
  [0.37325689975986093, 0.5417394107473964, 0.85263779777943449, 0.8690475526482232]
  [0.38822295169340526, 0.39501896531204311, 0.34024013200527753]
  [0.39322894970166955, 0.50858372738922808, 0.78198599467256291, 0.84944609042956076]
  [0.37134162681653765, 0.4311241326487949, 0.33021784520301201]
  [0.41741376254671592, 0.57624254561283739, 0.82054750482297978, 0.87449037068188429]
  [0.39922298585966876, 0.38544160462968524, 0.315412893638231]
  [0.36379855665245214, 0.53973099731916097, 0.83447785449484801, 0.84450100065947042]
  [0.4052424341113639, 0.396347938757389, 0.31503966573057418]
  [0.36806826715554225, 0.46411220662266794, 0.74537321684787672, 0.76718333060211008]
  [0.38699430870155543, 0.43620589967910517, 0.35207194271100223]
  [0.4010171898746055, 0.55307244750832385, 0.85310599751623217, 0.88206187596548713]
  [0.39417227962372098, 0.36054650500954533, 0.34714078064959619]
  [0.3513131477445553, 0.47819018818169634, 0.8084673126467431, 0.8616615651602898]
  [0.36307653454227573, 0.42002090421871824, 0.33695213253108086]
  [0.38413021986639778, 0.46708725734299195, 0.70300804523886629, 0.76042837765767479]
  [0.36857149315781396, 0.43710778666361405, 0.37726182565554056]
  [0.41406706279947175, 0.5088523632379699, 0.81064737621971361, 0.88362722364108237]
  [0.36085053673122996, 0.40038813337124235, 0.34114354119064882]
  [0.42848197503659979, 0.51047152951642982, 0.76189931401026501, 0.82013469412493023]
  [0.3653263918059409, 0.42419986481969857, 0.34456684831047157]
  [0.44789415161138046, 0.51257397787118497, 0.7638736958160689, 0.8452483847842871]
  [0.35550632819458949, 0.43234018701440774, 0.32731796067801705]
  [0.45013479943099166, 0.49826784961240544, 0.74615029899397112, 0.84172465459408397]
  [0.34530498281949995, 0.45345648721547327, 0.3181144177721022]
  [0.42739715713080878, 0.52829693427725022, 0.7964601181742329, 0.86698618631526381]
  [0.36044845383453583, 0.42624930262823041, 0.30497757966946026]
  [0.36971198307529207, 0.55412422504391257, 0.81905477027652096, 0.81836835067477454]
  [0.38513155753264072, 0.41383342588383742, 0.3124900125293934]
  [0.43078924678104435, 0.49943171960716187, 0.72102560043237496, 0.81507568932391905]
  [0.37760668013916698, 0.42987905934104131, 0.30072514024697594]
  [0.40193511344191329, 0.49254389421097838, 0.8209637658361949, 0.87448872826263302]
  [0.36725111581313075, 0.40699030643367101, 0.30361043951511535]
  [0.45130020133339793, 0.52481420623240205, 0.77079725169081148, 0.83083318615371582]
  [0.37644808620601788, 0.39021999920267364, 0.33389464274147557]
  [0.4693130594670914, 0.51858526198245891, 0.71063687738744064, 0.83466231054990625]
  [0.36010820232202823, 0.41274849899607502, 0.3211690583841012]
  [0.45681726145560142, 0.52003728855849429, 0.71442358971258324, 0.84273211317854624]
  [0.35045389737788607, 0.40299799520883656, 0.33745379382250368]
  [0.37272166160112574, 0.55265012978761197, 0.83986234564782958, 0.85467178142906786]
  [0.37372305625932151, 0.37316490051105572, 0.33174119916493344]
  [0.41591754010943471, 0.50979348861461848, 0.80122895185032006, 0.85182071810420579]
  [0.36046603395343685, 0.40472442079582616, 0.31810721714158563]
  [0.36828346806360746, 0.55114898775798027, 0.84682162658695725, 0.87304805830446286]
  [0.37476827239266125, 0.37753788033933544, 0.30646805731672017]
  [0.39807131766980136, 0.57126834219285305, 0.83353855677373301, 0.86784785604792558]
  [0.37536696503705869, 0.35893897943815634, 0.32934505336629571]
  [0.38215459732782064, 0.50629867370294124, 0.76062361755521279, 0.80877480577222782]
  [0.37518104035240157, 0.39477751660845622, 0.3316749132015484]
  [0.36698455994095341, 0.48635357654321187, 0.7656594069444066, 0.80840492550776355]
  [0.36470066626871217, 0.39598240649555927, 0.3500039498253707]
  [0.4482535587403958, 0.52418634087437377, 0.73410670681290169, 0.82974395782868859]
  [0.36655132380386274, 0.3630510349159688, 0.36260364908766091]
  [0.45326864680865014, 0.51785792640808548, 0.70760700660224396, 0.81552029715152008]
  [0.35899947847504654, 0.38434984299674108, 0.35407842792946009]
  [0.41887788956070282, 0.58749046721246401, 0.84930346558430336, 0.87416693300257819]
  [0.36536467888328522, 0.32570550572488766, 0.36872887674809013]
  [0.42230307924117966, 0.51852622808038329, 0.75789921486747802, 0.8511694070432394]
  [0.34081605249895702, 0.38416612470209183, 0.35304032071206948]
  [0.42091427540464293, 0.51528763140149358, 0.78004385522977449, 0.84766325647852114]
  [0.35524508414457812, 0.37386857237058529, 0.34375283591517836]
  [0.38138877093710216, 0.57565723853208595, 0.84882613155092634, 0.87585712546145589]
  [0.35691908999965005, 0.33451150118248635, 0.36441896812563418]
  [0.39307562598883034, 0.58902995691164139, 0.83938267539371658, 0.85578762741795056]
  [0.37546265959371411, 0.32352028217991624, 0.35572086456173208]
  [0.39470992188093629, 0.53664740929288102, 0.79823047360535737, 0.86257664850966675]
  [0.35219140115194986, 0.36494084986520892, 0.33770823562037555]
  [0.38740616578112019, 0.52850361821030922, 0.8173288857707357, 0.87539193269988747]
  [0.34366004827694346, 0.37960482266096357, 0.32412842349958881]
  [0.38638486953547047, 0.51225247316926181, 0.7525586876787288, 0.8097376252525712]
  [0.34379248107879379, 0.4161458372373687, 0.32999243758756502]
  [0.44815292804820117, 0.53290029516470805, 0.75938233097134133, 0.85395965589930634]
  [0.33806949786226087, 0.38496920605964896, 0.33593852797496426]
  [0.41870920050807953, 0.5486923911517595, 0.81386079230539121, 0.89910004196399362]
  [0.34518001992575997, 0.36124022494392954, 0.31691101388383208]
  [0.36538023891535198, 0.49490977179874179, 0.76724225776077015, 0.81443707005597632]
  [0.34007357494640772, 0.41967181508174284, 0.32917281671898785]
  [0.37288207778615179, 0.56239353946040793, 0.82706821708147604, 0.84233527179713963]
  [0.34756051034981073, 0.39483859778251318, 0.31427318314894021]
  [0.38808001357936117, 0.55849319568291067, 0.8460980122425964, 0.88217091102620404]
  [0.33516070583496299, 0.37779477902429992, 0.32520127677322241]
  [0.37449454171940633, 0.46307472734210625, 0.72293538779435151, 0.78060531051180815]
  [0.33882419892261323, 0.4352852051194494, 0.33732090261269015]
  [0.42711639944652324, 0.50918137999541702, 0.7985704737348357, 0.85362022368027701]
  [0.33841537592880233, 0.40326476707265024, 0.30878897363148294]
  [0.42122713716180959, 0.51273312930890491, 0.83242771118437009, 0.8966175781654987]
  [0.34335647073306264, 0.38420753485675219, 0.28914802626107866]
  [0.46394037757336926, 0.49973756117576157, 0.77107657151869102, 0.86785003407808936]
  [0.33908917906967734, 0.40942278720387137, 0.28600882124836274]
  [0.39067644133749896, 0.46982032001219376, 0.79860323670191269, 0.8264072434228048]
  [0.33472857987297888, 0.44333605231943324, 0.29370286368324133]
  [0.39903569336268185, 0.555302714613222, 0.81734652958520071, 0.84120338500910086]
  [0.34214178936750517, 0.39685212922460911, 0.30919768207270049]
  [0.42742661210224664, 0.47209998099744799, 0.75783986528528624, 0.81634003009978928]
  [0.34125071028669535, 0.4253288125663659, 0.30428997891812859]
  [0.40333248130099786, 0.52280469454746947, 0.86613160609656414, 0.89491665899015582]
  [0.35300036753891578, 0.37667809557996668, 0.27691296986002539]
  [0.41492980502219751, 0.46879051123468296, 0.71840744647393562, 0.79928258904850857]
  [0.34319827485949095, 0.41940125921821492, 0.32118303286342537]
  [0.3720027774163242, 0.45299448442366286, 0.79441385253767294, 0.84837842756829418]
  [0.32852838810851881, 0.42674248199833176, 0.30252906854647593]
  [0.38863047330065903, 0.50857211615029996, 0.86503418723235492, 0.91012546599452149]
  [0.32769515133040233, 0.37741213637921012, 0.30679441536113677]
  [0.37905365431570714, 0.44675301512241311, 0.74073223983253322, 0.76216491854348289]
  [0.33516359293762316, 0.42959904463876236, 0.36191814848415205]
  [0.38715719184812436, 0.54869368380990491, 0.83633760860384787, 0.8160955523804112]
  [0.35981613448732819, 0.35900705464206029, 0.34364368047316585]
  [0.50329413065135609, 0.52786863377131787, 0.71375541828963407, 0.83846990599941462]
  [0.34107568648695819, 0.38161966923175977, 0.31919325371136514]
  [0.38811624744800938, 0.54562321555712856, 0.84586142580226775, 0.85876414360315134]
  [0.35738192514272327, 0.36025711828689766, 0.31213358468155561]
  [0.38681332189873069, 0.49878951073062583, 0.77835789652630338, 0.83312648358311914]
  [0.34105473372401712, 0.38372026542152021, 0.33796483635893432]
  [0.39191089643620819, 0.46780792817664879, 0.79207483578700422, 0.82497693862098709]
  [0.3358269921429527, 0.38588366407657587, 0.3584541037291592]
  [0.42558864657056744, 0.50221800339998335, 0.74845035490852041, 0.81660867777937274]
  [0.35101473283503243, 0.36770179829650379, 0.34883720122646594]
  [0.45428619272203546, 0.52779870289551589, 0.79213230408290014, 0.86164961483436642]
  [0.34687696428943837, 0.35416182225002774, 0.32806537756538695]
  [0.37576436119130863, 0.57334365671246679, 0.81677679149633975, 0.80941928065820334]
  [0.35594574340911062, 0.36452358033318316, 0.3363076185554702]
  [0.49635812150074232, 0.52664838339610076, 0.71490334662640176, 0.8367402076551177]
  [0.35086086889886664, 0.36876684128772774, 0.31098424699705601]
  [0.40545981116329727, 0.48336255984408311, 0.81012241271521146, 0.86028868365077671]
  [0.35352795690566241, 0.37322841605709961, 0.30097385927744136]
  [0.39324444884111004, 0.55705361698020117, 0.82653697467887566, 0.84469209228224895]
  [0.38266462974715837, 0.33801547157091438, 0.29810424969321664]
  [0.39296992377156226, 0.49099207488156593, 0.76985695952314925, 0.82606625057644567]
  [0.36002369428119263, 0.38986047514312511, 0.29458570357642394]
  [0.36441512901851503, 0.56252145761051076, 0.81265336681671219, 0.8562492067881885]
  [0.37872189298468845, 0.34801086285849259, 0.28051918654635899]
  [0.38731594990059431, 0.56351693102878764, 0.84950769329641607, 0.89287066018979577]
  [0.37251815718567582, 0.32595946620565019, 0.28910976674764105]
  [0.36941689221542673, 0.50391237837672653, 0.76665333241715006, 0.82481737758682228]
  [0.35766115610629984, 0.36663125976941896, 0.32703102368109277]
  [0.35736109136541855, 0.56156824185361554, 0.82582578768411607, 0.84851403416393589]
  [0.37948813547262927, 0.32547371613454346, 0.31403564459282363]
  [0.36712806972535128, 0.51351432166618127, 0.79990958451401173, 0.86236892917610641]
  [0.35863055610963673, 0.33835615086055315, 0.32925202464824227]
  [0.35628275230465767, 0.56426538259087333, 0.83179280881724049, 0.87084458625195926]
  [0.36340797193207014, 0.30709423113283041, 0.35140258190280171]
  [0.43804381309546792, 0.51370761145504662, 0.71718165446496096, 0.80653748048504181]
  [0.372977760115424, 0.33563135107158804, 0.34819897133873667]
  [0.42398728053586798, 0.51112891982721864, 0.71962372595616153, 0.8194431733422366]
  [0.36121438059553407, 0.34959058161779288, 0.33585489861479967]
  [0.4078117064346039, 0.52327604843150599, 0.79725165661710251, 0.84133592190149864]
  [0.3613111836030059, 0.3238644522123264, 0.35155641339410665]
  [0.41834253186635817, 0.5065990983023867, 0.74859931837509153, 0.84075135927391897]
  [0.34678036679707397, 0.33122907410741192, 0.36960478223522653]
  [0.38630400249642904, 0.5570839300720013, 0.85136870593285818, 0.86972015311923467]
  [0.35245708902872747, 0.30809711733347711, 0.35836237622525718]
  [0.47383026940385148, 0.53261351691848235, 0.7176713418774906, 0.84088998000172721]
  [0.34191058305748429, 0.32346678034799858, 0.38029502535040238]
  [0.3896281892135024, 0.58232797825944582, 0.80071271238968056, 0.79823252691356072]
  [0.3564560562867003, 0.30297124426551308, 0.41903099176997977]
  [0.36245822934745342, 0.44279568236745231, 0.71412828426601294, 0.74903513961543289]
  [0.34201623693181715, 0.38189532589415476, 0.4002101063019019]
  [0.41313145281893338, 0.48339639676150603, 0.68072323650828581, 0.70643631659477701]
  [0.35683465082031568, 0.36191900354430345, 0.42765613020451332]
  [0.37988089746694725, 0.54552891882016508, 0.83229403921647138, 0.83287424349290573]
  [0.34383545737645532, 0.28904295820428166, 0.43245609056257073]
  [0.39005479082334865, 0.49845300916761087, 0.73990962807077987, 0.81198511360380843]
  [0.32660482405849678, 0.33908579914917408, 0.40943949475008296]
  [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
  [0, 1, 1, 2, 2, 1, 2, 2, 1, 0, 2, 0, 1, 0, 0, 1, 1, 2, 1, 2, 0, 1, 2, 1, 0, 0, 1, 0, 2, 0, 1, 0, 2, 1, 2, 1, 0, 2, 0, 0, 1, 0, 2, 1, 0, 0, 2, 2, 0, 1, 1, 2, 1, 2, 0, 1, 2, 0, 2, 1, 0, 2, 0, 2, 1, 0, 2, 1, 2, 1, 2, 1, 1, 0, 1, 2, 0, 2, 2, 0, 0, 2, 1, 0, 2, 2, 0, 0, 1, 2, 1, 1, 2, 2, 0, 0, 1, 0, 2, 1, 1, 2, 2, 2, 0, 2, 2, 1, 1, 0, 2, 2, 0, 2, 1, 0, 1, 0, 2, 1, 0, 1, 0, 1, 2, 0, 0, 2, 1, 0, 2, 1, 0, 1, 1, 2, 1, 2, 1, 0, 0, 2, 0, 1, 0, 1, 0, 0, 1, 2]
  0.333333333333
#+end_example

** Code
   #+BEGIN_SRC python :results output
  class myClass(object):
      def __init__(self, x):
          self._x = x

      @property
      def x(self):
          print "Calling the getter for my \"private\" member variable"
          return self._x

      @x.setter
      def x(self, x):
          print "Calling the setter for my \"private\" member variable"
          self._x = x

      @x.deleter
      def x(self):
          print "Calling the deleter for my \"private\" member variable"
          del self._x

  def example():
      classy = myClass(20)
      print(classy.x)
      classy.x = 30
      print(classy.x)
      del classy.x

  def main():
      print("Starting off the example")
      example()
      print("Ending the example")
  main()
   #+END_SRC

   #+RESULTS:
   : Starting off the example
   : Calling the getter for my "private" member variable
   : 20
   : Calling the setter for my "private" member variable
   : Calling the getter for my "private" member variable
   : 30
   : Calling the deleter for my "private" member variable
   : Ending the example
